In [1]:
URL='postgresql://observer:koh7theozoh8ohCh@5.79.73.74:5532/example'

In [2]:
import pandas as pd
import numpy as np
from datetime import datetime,timedelta
import psycopg2
from sqlalchemy import create_engine

## Загружаем данные

In [3]:
engine=create_engine(URL)
player=pd.read_sql_table('player',engine)
payment=pd.read_sql_table('payment',engine,columns=['id','createTime','playerId','currencyAmount','test','clientData'])
player.head()

       id    createTime
0  1001.0  1.483229e+09
1  1002.0  1.483229e+09
2  1003.0  1.483230e+09
3  1004.0  1.483231e+09
4  1005.0  1.483231e+09

In [4]:
payment.head()

,id,createTime,playerId,currencyAmount,test,clientData
0,12127,1.490004e+09,1077.0,3.54,False,"{'id': '12127', 'tax': 'not_taxed', 'user': {'..."
1,7737,1.488272e+09,1077.0,1.57,False,"{'id': '7737', 'tax': 'not_taxed', 'user': {'i..."
2,11677,1.489820e+09,1077.0,7.98,False,"{'id': '11677', 'tax': 'not_taxed', 'user': {'..."
3,6766,1.487827e+09,1077.0,7.24,False,"{'id': '6766', 'tax': 'not_taxed', 'user': {'i..."
4,12562,1.490179e+09,1077.0,9.68,False,"{'id': '12562', 'tax': 'not_taxed', 'user': {'..."

In [5]:
#payment.paymentProvider.value_counts()

In [6]:
#payment.currencyType.unique()


Переводим в вид дата-время

In [7]:
import datetime
print(datetime.datetime.fromtimestamp(player.createTime[0]))

2017-01-01 03:02:22

## Важно!!
Платежи могут быть в разных валютах. Перевести все суммы в доллары США (данные конвертации есть в clientData);

In [8]:
clientData=pd.DataFrame.from_dict(payment.clientData.tolist())
clientData.head()

      id  payout_foreign_exchange_rate        tax            user
0  12127                           1.0  not_taxed  {'id': '1077'}
1   7737                           1.0  not_taxed  {'id': '1077'}
2  11677                           1.0  not_taxed  {'id': '1077'}
3   6766                           1.0  not_taxed  {'id': '1077'}
4  12562                           1.0  not_taxed  {'id': '1077'}

In [9]:
clientData.id=clientData.id.astype('int64')
user=pd.DataFrame.from_dict(clientData.user.tolist())
user.columns=['user_id']
clientData=clientData.join(user)
clientData.drop("user",axis=1,inplace=True)
clientData.head()

      id  payout_foreign_exchange_rate        tax user_id
0  12127                           1.0  not_taxed    1077
1   7737                           1.0  not_taxed    1077
2  11677                           1.0  not_taxed    1077
3   6766                           1.0  not_taxed    1077
4  12562                           1.0  not_taxed    1077

Перевести время...

In [10]:
player.createTime.head()

0    1.483229e+09
1    1.483229e+09
2    1.483230e+09
3    1.483231e+09
4    1.483231e+09
Name: createTime, dtype: float64

In [11]:
print(datetime.datetime.fromtimestamp(player.createTime[0]))

2017-01-01 03:02:22

In [12]:
player.createTime=player.createTime.apply(lambda x: datetime.datetime.fromtimestamp(x))
clientData.head()

      id  payout_foreign_exchange_rate        tax user_id
0  12127                           1.0  not_taxed    1077
1   7737                           1.0  not_taxed    1077
2  11677                           1.0  not_taxed    1077
3   6766                           1.0  not_taxed    1077
4  12562                           1.0  not_taxed    1077

In [13]:
payment.createTime=payment.createTime.apply(lambda x: datetime.datetime.fromtimestamp(x))
payment.drop(['clientData'],axis=1,inplace=True)
payment.head()

      id          createTime  playerId  currencyAmount   test
0  12127 2017-03-20 13:00:28    1077.0            3.54  False
1   7737 2017-02-28 11:58:36    1077.0            1.57  False
2  11677 2017-03-18 09:55:13    1077.0            7.98  False
3   6766 2017-02-23 08:17:39    1077.0            7.24  False
4  12562 2017-03-22 13:30:40    1077.0            9.68  False

In [14]:
#payment.commitTime=payment.commitTime.apply(lambda x: datetime.datetime.fromtimestamp(x))

In [15]:
#payment.applyTime=payment.applyTime.apply(lambda x: datetime.datetime.fromtimestamp(x))

In [16]:
clientData.id=clientData.id.astype(dtype='int64',copy=False)
clientData.id.head()

0    12127
1     7737
2    11677
3     6766
4    12562
Name: id, dtype: int64

In [17]:
payment=payment.merge(clientData)
payment.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13543 entries, 0 to 13542
Data columns (total 8 columns):
id                              13543 non-null int64
createTime                      13543 non-null datetime64[ns]
playerId                        13543 non-null float64
currencyAmount                  13543 non-null float64
test                            13543 non-null bool
payout_foreign_exchange_rate    13543 non-null float64
tax                             13543 non-null object
user_id                         13543 non-null object
dtypes: bool(1), datetime64[ns](1), float64(3), int64(1), object(2)
memory usage: 859.7+ KB

In [18]:
player.head()

       id          createTime
0  1001.0 2017-01-01 03:02:22
1  1002.0 2017-01-01 03:05:31
2  1003.0 2017-01-01 03:13:44
3  1004.0 2017-01-01 03:36:38
4  1005.0 2017-01-01 03:38:20

In [19]:
player.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41213 entries, 0 to 41212
Data columns (total 2 columns):
id            41213 non-null float64
createTime    41213 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(1)
memory usage: 644.0 KB

In [20]:
player.id=player.id.astype(dtype='int64',copy=True)

In [21]:
player.id.head()

0    1001
1    1002
2    1003
3    1004
4    1005
Name: id, dtype: int64

In [22]:
player.shape

(41213, 2)

In [23]:
player.head()

     id          createTime
0  1001 2017-01-01 03:02:22
1  1002 2017-01-01 03:05:31
2  1003 2017-01-01 03:13:44
3  1004 2017-01-01 03:36:38
4  1005 2017-01-01 03:38:20

In [24]:
player['createTime']=player.createTime.dt.date
player.head()

     id  createTime
0  1001  2017-01-01
1  1002  2017-01-01
2  1003  2017-01-01
3  1004  2017-01-01
4  1005  2017-01-01

In [25]:
player.index

RangeIndex(start=0, stop=41213, step=1)

In [26]:
payment.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            13533, 13534, 13535, 13536, 13537, 13538, 13539, 13540, 13541,
            13542],
           dtype='int64', length=13543)

In [27]:
player[player.id==payment.id[0]].createTime
payment.playerId=payment.playerId.astype(dtype='int64')
payment.createTime=payment.createTime.dt.date
payment.head()

,id,createTime,playerId,currencyAmount,test,payout_foreign_exchange_rate,tax,user_id
0,12127,2017-03-20,1077,3.54,False,1.0,not_taxed,1077
1,7737,2017-02-28,1077,1.57,False,1.0,not_taxed,1077
2,11677,2017-03-18,1077,7.98,False,1.0,not_taxed,1077
3,6766,2017-02-23,1077,7.24,False,1.0,not_taxed,1077
4,12562,2017-03-22,1077,9.68,False,1.0,not_taxed,1077

## Важный момент!!!

In [28]:
player_pay=player[player.id.isin(payment.playerId)]
player_pay.columns=['user_id','signinTime']
payment.user_id.head()

0    1077
1    1077
2    1077
3    1077
4    1077
Name: user_id, dtype: object

In [29]:
payment.user_id=payment.user_id.astype(dtype='int64')
payment.user_id.head()

0    1077
1    1077
2    1077
3    1077
4    1077
Name: user_id, dtype: int64

In [30]:
player_pay.user_id.head()

12     1013
68     1069
76     1077
80     1081
142    1143
Name: user_id, dtype: int64

In [31]:
concatinated=pd.merge(payment,player_pay,on=['user_id'])
concatinated.head()

,id,createTime,playerId,currencyAmount,test,payout_foreign_exchange_rate,tax,user_id,signinTime
0,12127,2017-03-20,1077,3.54,False,1.0,not_taxed,1077,2017-01-01
1,7737,2017-02-28,1077,1.57,False,1.0,not_taxed,1077,2017-01-01
2,11677,2017-03-18,1077,7.98,False,1.0,not_taxed,1077,2017-01-01
3,6766,2017-02-23,1077,7.24,False,1.0,not_taxed,1077,2017-01-01
4,12562,2017-03-22,1077,9.68,False,1.0,not_taxed,1077,2017-01-01

In [32]:
concatinated.signinTime.head()

0    2017-01-01
1    2017-01-01
2    2017-01-01
3    2017-01-01
4    2017-01-01
Name: signinTime, dtype: object

# Соединили!! 
## Теперь переводим из object в datetime

In [33]:
concatinated.signinTime=pd.to_datetime(concatinated.signinTime)
concatinated.signinTime.head()

0   2017-01-01
1   2017-01-01
2   2017-01-01
3   2017-01-01
4   2017-01-01
Name: signinTime, dtype: datetime64[ns]

# Как считать LTV
<b>LTV</b> когороты – это сумма всех платежей когорты за всё время, поделённая на Installs. <br>
<b>LTV</b> дня жизни – это накопительная метрика. Сумма платежей за текущий и все предыдущие дни жизни,<br>
поделенная на Installs. Она всегда только растёт со временем (либо не изменяется, если не было покупок).

<img src='LTV.jpg'>

mask = (df['birth_date'] > start_date) & (df['birth_date'] <= end_date)

In [34]:
#concatinated.signinTime#=pd.to_datetime(concatinated.signinTime).dt.date
concatinated.createTime=pd.to_datetime(pd.to_datetime(concatinated.createTime).dt.date)
concatinated.createTime.head()

0   2017-03-20
1   2017-02-28
2   2017-03-18
3   2017-02-23
4   2017-03-22
Name: createTime, dtype: datetime64[ns]

In [35]:
player.createTime=pd.to_datetime(pd.to_datetime(player.createTime).dt.date)
player.createTime.head()

0   2017-01-01
1   2017-01-01
2   2017-01-01
3   2017-01-01
4   2017-01-01
Name: createTime, dtype: datetime64[ns]

# Разобьём по дням

In [36]:
from datetime import datetime
from datetime import date
datetime.now().date()

datetime.date(2019, 4, 10)

<img src='LTV2.jpg'>

## Вводим время начала и время конца
# Важно!! вводим месяц-число-год

In [37]:
start_date="01-01-2017" #время начала
end_date="01-06-2017" #время конца

In [38]:
import datetime
dates=pd.date_range(start=str(start_date),end=str(end_date),freq='D')

In [39]:
dates

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', freq='D')

In [40]:
summa_of_all=[]
num_player=[]
summa=0.0
for i in dates: #delta.days
    
    currency=concatinated[~concatinated.test & (concatinated.signinTime==i)].currencyAmount
    exchage_rate=concatinated[~concatinated.test& (concatinated.signinTime==i)].payout_foreign_exchange_rate
    num_of_player=player[player.createTime==i].shape[0]
    summa=summa+(currency*exchage_rate).sum()/num_of_player
    summa_of_all.append(summa)
    num_player.append(num_of_player)

In [41]:
month=[]
days_that_see=(concatinated.createTime.max()-concatinated.createTime.min()).days
for chose_date_i in dates:
    days_after_reg=[]
    summa=0.0
    for ii in range(days_that_see): #delta.days
        one_day=chose_date_i+timedelta(days=ii)
        currency=concatinated[~concatinated.test & (concatinated.signinTime==chose_date_i)&(concatinated.createTime==one_day)].currencyAmount
        exchage_rate=concatinated[~concatinated.test& (concatinated.signinTime==chose_date_i)&(concatinated.createTime==one_day)].payout_foreign_exchange_rate
        num_of_player=player[player.createTime==chose_date_i].shape[0]
        summa=summa+(currency*exchage_rate).sum()/num_of_player
        days_after_reg.append(summa)
    month.append(days_after_reg)

In [42]:
data_1=pd.DataFrame({'Installs':num_player,'LTV':summa_of_all})
data_1.index=dates

In [43]:
type(dates[0])

pandas._libs.tslibs.timestamps.Timestamp

In [44]:
data_columns=['mounth '+ str(i) for i in range(1,days_that_see+1)]

In [45]:
print((concatinated.createTime.max()-concatinated.createTime.min()).days)

90

In [46]:
data=pd.DataFrame(columns=data_columns)
#data
for i,ii in zip(pd.to_datetime(player.createTime.unique()),range(len(month))):
    #print(i,ii)
    data.loc[i]=month[ii]

In [47]:
data.index==data_1.index

array([ True,  True,  True,  True,  True,  True])

In [48]:
fin=pd.concat([data_1,data],axis=1)

In [49]:
fin.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2017-01-01 to 2017-01-06
Freq: D
Data columns (total 92 columns):
Installs     6 non-null int64
LTV          6 non-null float64
mounth 1     6 non-null float64
mounth 2     6 non-null float64
mounth 3     6 non-null float64
mounth 4     6 non-null float64
mounth 5     6 non-null float64
mounth 6     6 non-null float64
mounth 7     6 non-null float64
mounth 8     6 non-null float64
mounth 9     6 non-null float64
mounth 10    6 non-null float64
mounth 11    6 non-null float64
mounth 12    6 non-null float64
mounth 13    6 non-null float64
mounth 14    6 non-null float64
mounth 15    6 non-null float64
mounth 16    6 non-null float64
mounth 17    6 non-null float64
mounth 18    6 non-null float64
mounth 19    6 non-null float64
mounth 20    6 non-null float64
mounth 21    6 non-null float64
mounth 22    6 non-null float64
mounth 23    6 non-null float64
mounth 24    6 non-null float64
mounth 25    6 non-null float64
mounth 26    6 non-null float64
mounth 27    6 non-null float64
mounth 28    6 non-null float64
mounth 29    6 non-null float64
mounth 30    6 non-null float64
mounth 31    6 non-null float64
mounth 32    6 non-null float64
mounth 33    6 non-null float64
mounth 34    6 non-null float64
mounth 35    6 non-null float64
mounth 36    6 non-null float64
mounth 37    6 non-null float64
mounth 38    6 non-null float64
mounth 39    6 non-null float64
mounth 40    6 non-null float64
mounth 41    6 non-null float64
mounth 42    6 non-null float64
mounth 43    6 non-null float64
mounth 44    6 non-null float64
mounth 45    6 non-null float64
mounth 46    6 non-null float64
mounth 47    6 non-null float64
mounth 48    6 non-null float64
mounth 49    6 non-null float64
mounth 50    6 non-null float64
mounth 51    6 non-null float64
mounth 52    6 non-null float64
mounth 53    6 non-null float64
mounth 54    6 non-null float64
mounth 55    6 non-null float64
mounth 56    6 non-null float64
mounth 57    6 non-null float64
mounth 58    6 non-null float64
mounth 59    6 non-null float64
mounth 60    6 non-null float64
mounth 61    6 non-null float64
mounth 62    6 non-null float64
mounth 63    6 non-null float64
mounth 64    6 non-null float64
mounth 65    6 non-null float64
mounth 66    6 non-null float64
mounth 67    6 non-null float64
mounth 68    6 non-null float64
mounth 69    6 non-null float64
mounth 70    6 non-null float64
mounth 71    6 non-null float64
mounth 72    6 non-null float64
mounth 73    6 non-null float64
mounth 74    6 non-null float64
mounth 75    6 non-null float64
mounth 76    6 non-null float64
mounth 77    6 non-null float64
mounth 78    6 non-null float64
mounth 79    6 non-null float64
mounth 80    6 non-null float64
mounth 81    6 non-null float64
mounth 82    6 non-null float64
mounth 83    6 non-null float64
mounth 84    6 non-null float64
mounth 85    6 non-null float64
mounth 86    6 non-null float64
mounth 87    6 non-null float64
mounth 88    6 non-null float64
mounth 89    6 non-null float64
mounth 90    6 non-null float64
dtypes: float64(91), int64(1)
memory usage: 4.4 KB

In [50]:
fin.head()

,Installs,LTV,mounth 1,mounth 2,mounth 3,mounth 4,mounth 5,mounth 6,mounth 7,mounth 8,...,mounth 81,mounth 82,mounth 83,mounth 84,mounth 85,mounth 86,mounth 87,mounth 88,mounth 89,mounth 90
2017-01-01,523,0.891306,0.104054,0.120806,0.151973,0.151973,0.179888,0.179888,0.244247,0.244247,...,0.844024,0.844024,0.844024,0.844024,0.851762,0.876901,0.882100,0.882100,0.885160,0.891306
2017-01-02,614,2.184452,0.006026,0.054784,0.103085,0.117222,0.159144,0.306603,0.386994,0.734583,...,1.231141,1.244789,1.245799,1.247542,1.247542,1.258845,1.258845,1.258845,1.290984,1.293145
2017-01-03,552,8.965429,0.035878,0.095442,0.120286,0.259471,0.353679,0.371777,0.379096,0.394598,...,6.747519,6.747519,6.757701,6.767064,6.767064,6.767064,6.780977,6.780977,6.780977,6.780977
2017-01-04,536,14.762330,0.018713,0.051119,0.087633,0.119554,0.165674,0.243073,0.267569,0.273428,...,5.425620,5.606196,5.609088,5.614311,5.698543,5.771621,5.796901,5.796901,5.796901,5.796901
2017-01-05,468,16.991774,0.008034,0.053504,0.058098,0.067158,0.080276,0.084741,0.086579,0.086579,...,2.143871,2.143871,2.165708,2.165708,2.198016,2.229445,2.229445,2.229445,2.229445,2.229445

In [51]:
fin.tail()

,Installs,LTV,mounth 1,mounth 2,mounth 3,mounth 4,mounth 5,mounth 6,mounth 7,mounth 8,...,mounth 81,mounth 82,mounth 83,mounth 84,mounth 85,mounth 86,mounth 87,mounth 88,mounth 89,mounth 90
2017-01-02,614,2.184452,0.006026,0.054784,0.103085,0.117222,0.159144,0.306603,0.386994,0.734583,...,1.231141,1.244789,1.245799,1.247542,1.247542,1.258845,1.258845,1.258845,1.290984,1.293145
2017-01-03,552,8.965429,0.035878,0.095442,0.120286,0.259471,0.353679,0.371777,0.379096,0.394598,...,6.747519,6.747519,6.757701,6.767064,6.767064,6.767064,6.780977,6.780977,6.780977,6.780977
2017-01-04,536,14.762330,0.018713,0.051119,0.087633,0.119554,0.165674,0.243073,0.267569,0.273428,...,5.425620,5.606196,5.609088,5.614311,5.698543,5.771621,5.796901,5.796901,5.796901,5.796901
2017-01-05,468,16.991774,0.008034,0.053504,0.058098,0.067158,0.080276,0.084741,0.086579,0.086579,...,2.143871,2.143871,2.165708,2.165708,2.198016,2.229445,2.229445,2.229445,2.229445,2.229445
2017-01-06,485,28.330068,0.133960,0.309589,0.494744,0.522106,0.780984,0.898515,0.996743,1.060609,...,11.055784,11.069578,11.089491,11.109717,11.338294,11.338294,11.338294,11.338294,11.338294,11.338294

# Конец!!!
Результат:

In [52]:
fin

,Installs,LTV,mounth 1,mounth 2,mounth 3,mounth 4,mounth 5,mounth 6,mounth 7,mounth 8,...,mounth 81,mounth 82,mounth 83,mounth 84,mounth 85,mounth 86,mounth 87,mounth 88,mounth 89,mounth 90
2017-01-01,523,0.891306,0.104054,0.120806,0.151973,0.151973,0.179888,0.179888,0.244247,0.244247,...,0.844024,0.844024,0.844024,0.844024,0.851762,0.876901,0.882100,0.882100,0.885160,0.891306
2017-01-02,614,2.184452,0.006026,0.054784,0.103085,0.117222,0.159144,0.306603,0.386994,0.734583,...,1.231141,1.244789,1.245799,1.247542,1.247542,1.258845,1.258845,1.258845,1.290984,1.293145
2017-01-03,552,8.965429,0.035878,0.095442,0.120286,0.259471,0.353679,0.371777,0.379096,0.394598,...,6.747519,6.747519,6.757701,6.767064,6.767064,6.767064,6.780977,6.780977,6.780977,6.780977
2017-01-04,536,14.762330,0.018713,0.051119,0.087633,0.119554,0.165674,0.243073,0.267569,0.273428,...,5.425620,5.606196,5.609088,5.614311,5.698543,5.771621,5.796901,5.796901,5.796901,5.796901
2017-01-05,468,16.991774,0.008034,0.053504,0.058098,0.067158,0.080276,0.084741,0.086579,0.086579,...,2.143871,2.143871,2.165708,2.165708,2.198016,2.229445,2.229445,2.229445,2.229445,2.229445
2017-01-06,485,28.330068,0.133960,0.309589,0.494744,0.522106,0.780984,0.898515,0.996743,1.060609,...,11.055784,11.069578,11.089491,11.109717,11.338294,11.338294,11.338294,11.338294,11.338294,11.338294